#pragma once
#include "../functions/functions.h"


// l8_1 -- встраивание функции
void l8_1();

// l8_2 -- определение и использование ссылки
void l8_2();

// l8_3 -- определение и использование ссылки
void l8_3();

// l8_4 -- обмен значениями с помощью ссылок и указателей
void l8_4();

// l8-5 -- обычные и ссылочные переменные
void l8_5();

// l8-6 -- использование ссылок на структуры
void l8_6();

// l8-7 -- использование ссылок в функциях
void l8_7();

// l8-8 -- функция с формальным аргументом-ссылкой на класс ostream
void l8_8();

// l8-9 -- аргументы по умолчанию
void l8_9();

// l8-10 -- перегрузка функции left()
void l8_10();

// l8-11 -- использование шаблонов функций
void l8_11();

// l8-12 -- использование перегрузки шаблонов функций
void l8_12();

// l8-13 -- использование явной специализации в шаблонах функций
void l8_13();

// l8-14 -- перегрузка шаблонов
void l8_14();

// l8-15 -- указание компилятору на конкретный вызов
void l8_15();

// sol-8-1 -- ДЗ1
void sol_8_1();

// sol-8-2 -- ДЗ2
void sol_8_2();

// sol-8-3 -- ДЗ3
void sol_8_3();

// sol-8-4 -- ДЗ4
void sol_8_4();

// sol-8-5 -- ДЗ5
void sol_8_5();

// sol-8-6 -- ДЗ6
void sol_8_6();

// sol-8-7 -- ДЗ7
void sol_8_7();

// l9-1 -- раздельная компиляция
void l9_1();