#pragma once

// l8_1 -- встраивание функции
void l8_1();

// l8_2 -- определение и использование ссылки
void l8_2();

// l8_3 -- определение и использование ссылки
void l8_3();

// l8_4 -- обмен значениями с помощью ссылок и указателей
void l8_4();

// l8-5 -- обычные и ссылочные переменные
void l8_5();

// l8-6 -- использование ссылок на структуры
void l8_6();

// l8-7 -- использование ссылок в функциях
void l8_7();

// l8-8 -- функция с формальным аргемнтом-ссылкой на класс ostream
void l8_8();

// l8-9 -- аргументы по умолчанию
void l8_9();

// l8-10 -- перегрузка функции left()
void l8_10();

// l8-11 -- использование шаблонов функций
void l8_11();

// l8-12 -- использование перегрузки шаблонов функций
void l8_12();

// l8-13 -- использование явной специализации в шаблонах функций
void l8_13();